MohammadJRanjbar/Making-an-irrigation-system-using-STM32F103CBT6-LCD-Keypad-and-YL_69-soil-moisture-sensor/Codes/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LCD_D7_Pin GPIO_PIN_13
#define LCD_D7_GPIO_Port GPIOC
#define LCD_D6_Pin GPIO_PIN_14
#define LCD_D6_GPIO_Port GPIOC
#define LCD_D5_Pin GPIO_PIN_15
#define LCD_D5_GPIO_Port GPIOC
#define LCD_D4_Pin GPIO_PIN_0
#define LCD_D4_GPIO_Port GPIOA
#define LCD_E_Pin GPIO_PIN_1
#define LCD_E_GPIO_Port GPIOA
#define LCD_RS_Pin GPIO_PIN_2
#define LCD_RS_GPIO_Port GPIOA
#define valve_Pin GPIO_PIN_11
#define valve_GPIO_Port GPIOA
#define soil_Pin GPIO_PIN_12
#define soil_GPIO_Port GPIOA
#define row1_Pin GPIO_PIN_15
#define row1_GPIO_Port GPIOA
#define row2_Pin GPIO_PIN_3
#define row2_GPIO_Port GPIOB
#define row3_Pin GPIO_PIN_4
#define row3_GPIO_Port GPIOB
#define row4_Pin GPIO_PIN_5
#define row4_GPIO_Port GPIOB
#define col1_Pin GPIO_PIN_6
#define col1_GPIO_Port GPIOB
#define col1_EXTI_IRQn EXTI9_5_IRQn
#define col2_Pin GPIO_PIN_7
#define col2_GPIO_Port GPIOB
#define col2_EXTI_IRQn EXTI9_5_IRQn
#define col3_Pin GPIO_PIN_8
#define col3_GPIO_Port GPIOB
#define col3_EXTI_IRQn EXTI9_5_IRQn
#define col4_Pin GPIO_PIN_9
#define col4_GPIO_Port GPIOB
#define col4_EXTI_IRQn EXTI9_5_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
